app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("created_at", "title", "method", "updated_at") VALUES('2011-01-31 11:36:27', 'Egg on Toast', 'test', '2011-01-31 11:36:27')
---
  def create
			@recipe = Recipe.new(params[:recipe])
			if @recipe.save